In [2]:
import pandas as pd

df = pd.DataFrame(data= {'name':['john', 'mary', 'peter','jeff','bill', 'lisa'], 'age':[23, 78, 22, 19, 45, 33], 
                         'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'], 'num_children': [2, 2, 0, 1, 2, 1],
                        'num_pets' : [0, 4, 0, 5, 0, 0]})

In [3]:
df

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0
3   jeff   19       texas             1         5
4   bill   45  washington             2         0
5   lisa   33          dc             1         0

In [4]:
df.columns

Index(['name', 'age', 'state', 'num_children', 'num_pets'], dtype='object')

In [7]:
# Interested in just the first 3 columns? Specify just name, age, and state. Note the [[]]

In [8]:
df[['name', 'age', 'state']]

    name  age       state
0   john   23        iowa
1   mary   78          dc
2  peter   22  california
3   jeff   19       texas
4   bill   45  washington
5   lisa   33          dc

In [9]:
# Select the second to fourth rows based on columns (name and age for example)

In [10]:
df.loc[2:4, 'name']

2    peter
3     jeff
4     bill
Name: name, dtype: object

In [14]:
df.loc[2:4, ['name', 'age']]

    name  age
2  peter   22
3   jeff   19
4   bill   45

In [11]:
df.loc[:, ['name', 'age']]

    name  age
0   john   23
1   mary   78
2  peter   22
3   jeff   19
4   bill   45
5   lisa   33

In [19]:
# Select the first 2 rows
df.iloc[:2]

   name  age state  num_children  num_pets
0  john   23  iowa             2         0
1  mary   78    dc             2         4

In [21]:
# Select the last 2 rows
df.iloc[-2:]

   name  age       state  num_children  num_pets
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [26]:
# Select rows up to and including the assigned. Here, up to and inc. the one w/ index = 2
df.loc[:2]

    name  age       state  num_children  num_pets
0   john   23        iowa             2         0
1   mary   78          dc             2         4
2  peter   22  california             0         0

In [100]:
# Select the first column without specifying the name of column. The : returns all rows
df.iloc[:,1]

0    23
1    78
2    22
3    19
4    45
5    33
Name: age, dtype: int64

In [34]:
df.loc[:,['age', 'state']]
# df[['age', 'state']]

   age       state
0   23        iowa
1   78          dc
2   22  california
3   19       texas
4   45  washington
5   33          dc

In [35]:
# Filter or conditional selection of dataframe
# Here, let's try people whose "age" is greater than 30
df[df['age'] > 30]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [37]:
# Another way to do the above. They are exactly the same.
df[df.age > 30]

   name  age       state  num_children  num_pets
1  mary   78          dc             2         4
4  bill   45  washington             2         0
5  lisa   33          dc             1         0

In [38]:
# Select dataframe such that the return dataframe has more pets than children
df[df.num_children < df.num_pets]

   name  age  state  num_children  num_pets
1  mary   78     dc             2         4
3  jeff   19  texas             1         5

In [40]:
# Trying it another way
df[df['num_children'] < df['num_pets']]

   name  age  state  num_children  num_pets
1  mary   78     dc             2         4
3  jeff   19  texas             1         5

In [52]:
# Who in the dataframe is older than 40 and owns pets?
# Need to use parens
df[(df['age'] > 40) & (df['num_pets'] > 0)]

   name  age state  num_children  num_pets
1  mary   78    dc             2         4

In [63]:
# Drop age and num_children columns
# After dropping, the actual ORIGINAL dataframe is untouched
# Drop is for a column or w/e. It's not for data filtering (exclude those over 40, etc.)
# Axis = the thing you're trying to drop. Looks for the columns to drop here
df.drop(['age','num_children'],axis=1)

    name       state  num_pets
0   john        iowa         0
1   mary          dc         4
2  peter  california         0
3   jeff       texas         5
4   bill  washington         0
5   lisa          dc         0

In [66]:
# This also works
df.drop(columns=["age", "num_children"])

    name       state  num_pets
0   john        iowa         0
1   mary          dc         4
2  peter  california         0
3   jeff       texas         5
4   bill  washington         0
5   lisa          dc         0

In [71]:
# What is the average for age, num_pets, and num_children
df.describe()

             age  num_children  num_pets
count   6.000000      6.000000  6.000000
mean   36.666667      1.333333  1.500000
std    22.384518      0.816497  2.345208
min    19.000000      0.000000  0.000000
25%    22.250000      1.000000  0.000000
50%    28.000000      1.500000  0.000000
75%    42.000000      2.000000  3.000000
max    78.000000      2.000000  5.000000

In [81]:
# OR, apply an aggregate function to every column
import numpy as np
df[["age","num_pets","num_children"]].apply(lambda col: np.mean(col), axis=0)

age             36.666667
num_pets         1.500000
num_children     1.333333
dtype: float64

In [72]:
df.mean()

age             36.666667
num_children     1.333333
num_pets         1.500000
dtype: float64

In [83]:
# Selecting dataframe based on column name.
# First type: returns dataframe
df[['age']]

   age
0   23
1   78
2   22
3   19
4   45
5   33

In [88]:
# Second type: not a dataframe. This is a Panda series
df['age']

0    23
1    78
2    22
3    19
4    45
5    33
Name: age, dtype: int64

In [91]:
type(df['age']) #This is how we know it's a series

pandas.core.series.Series

In [92]:
type(df[['age']]) #Determining what the other one is. Dataframe!

pandas.core.frame.DataFrame

In [97]:
# Return dataframe with ages * 2
df[['age']].apply(lambda value: value * 2)

   age
0   46
1  156
2   44
3   38
4   90
5   66

In [120]:
# Return dataframe with ages column doubled
df['age'] = df[['age']].apply(lambda value: value * 2)
df

    name    age       state  num_children  num_pets
0   john   46.0        iowa             2         0
1   mary  156.0          dc             2         4
2  peter   44.0  california             0         0
3   jeff   38.0       texas             1         5
4   bill   90.0  washington             2         0
5   lisa   66.0          dc             1         0

In [121]:
# Sort dataframe based on a specific column in ascending order
df.sort_values(by='age', ascending=True)

    name    age       state  num_children  num_pets
3   jeff   38.0       texas             1         5
2  peter   44.0  california             0         0
0   john   46.0        iowa             2         0
5   lisa   66.0          dc             1         0
4   bill   90.0  washington             2         0
1   mary  156.0          dc             2         4

In [132]:
# Select rows whose name begins with "j"
# df.row.startswith('j') #This doesn't work lol
df[df.apply(lambda row: row['name'].startswith('j'),axis=1)]

   name   age  state  num_children  num_pets
0  john  46.0   iowa             2         0
3  jeff  38.0  texas             1         5

In [128]:
# Vincenzo's
df[df['name'].apply(lambda x: x[0] == 'j')]

   name   age  state  num_children  num_pets
0  john  46.0   iowa             2         0
3  jeff  38.0  texas             1         5

In [129]:
# Vincenzo's cleaner way
df[df.name.str.startswith('j')]

   name   age  state  num_children  num_pets
0  john  46.0   iowa             2         0
3  jeff  38.0  texas             1         5

In [133]:
# New problem we're tackling

In [134]:
from collections import OrderedDict
from pandas import DataFrame
import pandas as pd
import numpy as np

table = OrderedDict((
    ('Item', ['Item0', 'Item0', 'Item1', 'Item1']),
    ('CType', ['Gold', 'Bronze', 'Gold', 'Silver']),
    ('USD', ['1$', '2$', '3$', '4$']),
    ('EU', ['1€', '2€', '3€', '4€'])
))
d = DataFrame(table)
d

    Item   CType USD  EU
0  Item0    Gold  1$  1€
1  Item0  Bronze  2$  2€
2  Item1    Gold  3$  3€
3  Item1  Silver  4$  4€

In [137]:
# Pivot table from dataframe
# Telling it to use Item as the index now, and we're only interested in the USD values
p = d.pivot(index='Item', columns='CType', values='USD')
p

CType Bronze Gold Silver
Item
Item0     2$   1$    NaN
Item1    NaN   3$     4$